### Terraform Plan Output
```
[command]/home/runner/work/_temp/a959d4d1-c6f2-435a-99ba-8d1e2bc0f51f/terraform-bin plan -no-color -var git_branch=16/merge -var environment=npe -var filepath=base-eng-fxn-bucket
2024-05-26T09:33:51.950Z [INFO]  Terraform version: 1.5.3
2024-05-26T09:33:51.950Z [INFO]  Go runtime version: go1.20
2024-05-26T09:33:51.950Z [INFO]  CLI args: []string{"/home/runner/work/_temp/a959d4d1-c6f2-435a-99ba-8d1e2bc0f51f/terraform-bin", "plan", "-no-color", "-var", "git_branch=16/merge", "-var", "environment=npe", "-var", "filepath=base-eng-fxn-bucket"}
2024-05-26T09:33:51.950Z [INFO]  CLI command args: []string{"plan", "-no-color", "-var", "git_branch=16/merge", "-var", "environment=npe", "-var", "filepath=base-eng-fxn-bucket"}
2024-05-26T09:33:51.954Z [INFO]  AWS Auth provider used: "EnvProvider"
2024-05-26T09:33:53.170Z [INFO]  backend/local: starting Plan operation
2024-05-26T09:33:53.865Z [INFO]  provider: configuring client automatic mTLS
2024-05-26T09:33:53.970Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: configuring server automatic mTLS: timestamp=2024-05-26T09:33:53.970Z
2024-05-26T09:33:54.648Z [INFO]  provider: configuring client automatic mTLS
2024-05-26T09:33:54.730Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: configuring server automatic mTLS: timestamp=2024-05-26T09:33:54.730Z
2024-05-26T09:33:55.355Z [INFO]  backend/local: plan calling Plan
2024-05-26T09:33:55.358Z [INFO]  provider: configuring client automatic mTLS
2024-05-26T09:33:55.441Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: configuring server automatic mTLS: timestamp=2024-05-26T09:33:55.440Z
2024-05-26T09:33:56.028Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: Retrieved credentials: tf_rpc=ConfigureProvider tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws @module=aws.aws-base tf_aws.credentials_source=EnvConfigCredentials tf_req_id=b8c4cf02-70f3-67e2-88c4-24eae9cd997e @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 timestamp=2024-05-26T09:33:56.028Z
2024-05-26T09:33:56.406Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: Retrieved caller identity from STS: tf_mux_provider=*schema.GRPCProviderServer tf_req_id=b8c4cf02-70f3-67e2-88c4-24eae9cd997e @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 timestamp=2024-05-26T09:33:56.406Z
2024-05-26T09:33:56.408Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
2024-05-26T09:33:56.408Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
2024-05-26T09:33:56.408Z [INFO]  ReferenceTransformer: reference not found: "var.function_name"
2024-05-26T09:33:56.408Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
2024-05-26T09:33:56.408Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
aws_cloudwatch_log_group.event_handler: Refreshing state... [id=/aws/lambda/chatting_api_uat]
aws_iam_role.event_handler_execution_role: Refreshing state... [id=event_handler_execution_role_uat]
aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=/aws/api-gateway/event_handler-uat]
aws_apigatewayv2_api.event_handler: Refreshing state... [id=uzl46m03j6]
2024-05-26T09:33:56.634Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_role.event_handler_execution_role during refresh.
      - .tags: was null, but now cty.MapValEmpty(cty.String)
      - .inline_policy: actual set element cty.ObjectVal(map[string]cty.Value{"name":cty.StringVal("chatting_api_uat"), "policy":cty.StringVal("{\"Version\":\"2012-10-17\",\"Statement\":[{\"Action\":[\"logs:PutLogEvents\",\"logs:CreateLogStream\"],\"Effect\":\"Allow\",\"Resource\":\"arn:aws:logs:eu-west-2:306744105408:log-group:/aws/lambda/chatting_api_uat*\",\"Sid\":\"EventHandlerPolicy\"}]}")}) does not correlate with any element in plan
      - .inline_policy: block set length changed from 0 to 1
2024-05-26T09:33:56.637Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_role.event_handler_execution_role, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .force_detach_policies: planned value cty.False for a non-computed attribute
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .description: planned value cty.StringVal("") for a non-computed attribute
      - .permissions_boundary: planned value cty.StringVal("") for a non-computed attribute
2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.publish"
2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.architectures"
2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.git_branch"
2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.filepath"
2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.runtime"
2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.function_name"
2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.timeout"
2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.package_type"
2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.function_handler"
2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.function_name"
2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.log_level"
aws_lambda_function.event_handler: Refreshing state... [id=chatting_api_uat]
2024-05-26T09:33:56.770Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_apigatewayv2_api.event_handler during refresh.
      - .tags: was null, but now cty.MapValEmpty(cty.String)
2024-05-26T09:33:56.773Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_apigatewayv2_api.event_handler, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .description: planned value cty.StringVal("") for a non-computed attribute
      - .route_selection_expression: planned value cty.StringVal("$request.method $request.path") for a non-computed attribute
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .version: planned value cty.StringVal("") for a non-computed attribute
      - .api_key_selection_expression: planned value cty.StringVal("$request.header.x-api-key") for a non-computed attribute
      - .disable_execute_api_endpoint: planned value cty.False for a non-computed attribute
2024-05-26T09:33:56.894Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_cloudwatch_log_group.event_handler during refresh.
      - .tags: was null, but now cty.MapValEmpty(cty.String)
2024-05-26T09:33:56.897Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_log_group.event_handler, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .kms_key_id: planned value cty.StringVal("") for a non-computed attribute
      - .skip_destroy: planned value cty.False for a non-computed attribute
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
2024-05-26T09:33:56.899Z [INFO]  ReferenceTransformer: reference not found: "var.function_name"
2024-05-26T09:33:56.899Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
2024-05-26T09:33:56.900Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_cloudwatch_log_group.api_gateway during refresh.
      - .tags: was null, but now cty.MapValEmpty(cty.String)
aws_iam_role_policy.event_handler: Refreshing state... [id=event_handler_execution_role_uat:chatting_api_uat]
2024-05-26T09:33:56.903Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_log_group.api_gateway, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .skip_destroy: planned value cty.False for a non-computed attribute
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .kms_key_id: planned value cty.StringVal("") for a non-computed attribute
2024-05-26T09:33:56.904Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
aws_apigatewayv2_stage.event_handler: Refreshing state... [id=uat]
2024-05-26T09:33:57.214Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_lambda_function.event_handler during refresh.
      - .tags: was null, but now cty.MapValEmpty(cty.String)
      - .last_modified: was cty.StringVal("2024-05-26T09:23:35.359+0000"), but now cty.StringVal("2024-05-26T09:23:41.349+0000")
      - .layers: was null, but now cty.ListValEmpty(cty.String)
2024-05-26T09:33:57.221Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lambda_function.event_handler, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .kms_key_arn: planned value cty.StringVal("") for a non-computed attribute
      - .layers: planned value cty.ListValEmpty(cty.String) for a non-computed attribute
      - .code_signing_config_arn: planned value cty.StringVal("") for a non-computed attribute
      - .skip_destroy: planned value cty.False for a non-computed attribute
      - .reserved_concurrent_executions: planned value cty.NumberIntVal(-1) for a non-computed attribute
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .image_uri: planned value cty.StringVal("") for a non-computed attribute
      - .memory_size: planned value cty.NumberIntVal(128) for a non-computed attribute
      - .description: planned value cty.StringVal("") for a non-computed attribute
      - .logging_config: block count in plan (1) disagrees with count in config (0)
      - .ephemeral_storage: block count in plan (1) disagrees with count in config (0)
      - .tracing_config: block count in plan (1) disagrees with count in config (0)
2024-05-26T09:33:57.228Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
aws_lambda_permission.event_handler: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_integration.event_handler: Refreshing state... [id=qws0yrt]
2024-05-26T09:33:57.263Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_apigatewayv2_stage.event_handler during refresh.
      - .deployment_id: was cty.StringVal(""), but now cty.StringVal("o7f53q")
      - .stage_variables: was null, but now cty.MapValEmpty(cty.String)
      - .tags: was null, but now cty.MapValEmpty(cty.String)
2024-05-26T09:33:57.266Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_apigatewayv2_stage.event_handler, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .description: planned value cty.StringVal("") for a non-computed attribute
      - .stage_variables: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .client_certificate_id: planned value cty.StringVal("") for a non-computed attribute
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .default_route_settings: block count in plan (1) disagrees with count in config (0)
2024-05-26T09:33:57.332Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lambda_permission.event_handler, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .qualifier: planned value cty.StringVal("") for a non-computed attribute
2024-05-26T09:33:57.386Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_apigatewayv2_integration.event_handler during refresh.
      - .request_parameters: was null, but now cty.MapValEmpty(cty.String)
      - .request_templates: was null, but now cty.MapValEmpty(cty.String)
2024-05-26T09:33:57.389Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_apigatewayv2_integration.event_handler, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .template_selection_expression: planned value cty.StringVal("") for a non-computed attribute
      - .content_handling_strategy: planned value cty.StringVal("") for a non-computed attribute
      - .integration_subtype: planned value cty.StringVal("") for a non-computed attribute
      - .request_parameters: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .passthrough_behavior: planned value cty.StringVal("") for a non-computed attribute
      - .payload_format_version: planned value cty.StringVal("1.0") for a non-computed attribute
      - .connection_id: planned value cty.StringVal("") for a non-computed attribute
      - .credentials_arn: planned value cty.StringVal("") for a non-computed attribute
      - .description: planned value cty.StringVal("") for a non-computed attribute
      - .request_templates: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
aws_apigatewayv2_route.event_handler: Refreshing state... [id=oafi1hp]
2024-05-26T09:33:57.542Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_apigatewayv2_route.event_handler during refresh.
      - .request_models: was null, but now cty.MapValEmpty(cty.String)
      - .authorization_scopes: was null, but now cty.SetValEmpty(cty.String)
2024-05-26T09:33:57.544Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_apigatewayv2_route.event_handler, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .api_key_required: planned value cty.False for a non-computed attribute
      - .authorization_scopes: planned value cty.SetValEmpty(cty.String) for a non-computed attribute
      - .authorizer_id: planned value cty.StringVal("") for a non-computed attribute
      - .request_models: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .operation_name: planned value cty.StringVal("") for a non-computed attribute
      - .route_response_selection_expression: planned value cty.StringVal("") for a non-computed attribute
      - .authorization_type: planned value cty.StringVal("NONE") for a non-computed attribute
      - .model_selection_expression: planned value cty.StringVal("") for a non-computed attribute
2024-05-26T09:33:57.558Z [INFO]  backend/local: plan operation completed

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.event_handler will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "event_handler" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "EventHandlerPolicy"
        }
    }

  # aws_apigatewayv2_api.event_handler will be updated in-place
  ~ resource "aws_apigatewayv2_api" "event_handler" {
        id                           = "uzl46m03j6"
      ~ name                         = "event-handler-uat" -> "event-handler-npe"
        tags                         = {}
        # (8 unchanged attributes hidden)
    }

  # aws_apigatewayv2_integration.event_handler will be updated in-place
  ~ resource "aws_apigatewayv2_integration" "event_handler" {
        id                     = "qws0yrt"
      ~ integration_uri        = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:306744105408:function:chatting_api_uat/invocations" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_apigatewayv2_stage.event_handler must be replaced
-/+ resource "aws_apigatewayv2_stage" "event_handler" {
      ~ arn             = "arn:aws:apigateway:eu-west-2::/apis/uzl46m03j6/stages/uat" -> (known after apply)
      ~ deployment_id   = "o7f53q" -> (known after apply)
      ~ execution_arn   = "arn:aws:execute-api:eu-west-2:306744105408:uzl46m03j6/uat" -> (known after apply)
      ~ id              = "uat" -> (known after apply)
      ~ invoke_url      = "https://uzl46m03j6.execute-api.eu-west-2.amazonaws.com/uat" -> (known after apply)
      ~ name            = "uat" -> "npe" # forces replacement
      - stage_variables = {} -> null
      - tags            = {} -> null
      ~ tags_all        = {} -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ access_log_settings {
          ~ destination_arn = "arn:aws:logs:eu-west-2:306744105408:log-group:/aws/api-gateway/event_handler-uat" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      - default_route_settings {
          - data_trace_enabled       = false -> null
          - detailed_metrics_enabled = false -> null
          - throttling_burst_limit   = 0 -> null
          - throttling_rate_limit    = 0 -> null
        }
    }

  # aws_cloudwatch_log_group.api_gateway must be replaced
-/+ resource "aws_cloudwatch_log_group" "api_gateway" {
      ~ arn               = "arn:aws:logs:eu-west-2:306744105408:log-group:/aws/api-gateway/event_handler-uat" -> (known after apply)
      ~ id                = "/aws/api-gateway/event_handler-uat" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/api-gateway/event_handler-uat" -> "/aws/api-gateway/event_handler-npe" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.event_handler must be replaced
-/+ resource "aws_cloudwatch_log_group" "event_handler" {
      ~ arn               = "arn:aws:logs:eu-west-2:306744105408:log-group:/aws/lambda/chatting_api_uat" -> (known after apply)
      ~ id                = "/aws/lambda/chatting_api_uat" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/chatting_api_uat" -> "/aws/lambda/chatting_api_npe" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role.event_handler_execution_role must be replaced
-/+ resource "aws_iam_role" "event_handler_execution_role" {
      ~ arn                   = "arn:aws:iam::306744105408:role/service-role/event_handler_execution_role_uat" -> (known after apply)
      ~ create_date           = "2024-05-26T09:23:26Z" -> (known after apply)
      ~ id                    = "event_handler_execution_role_uat" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "event_handler_execution_role_uat" -> "event_handler_execution_role_npe" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAUO227THAGQ5WMUQDP" -> (known after apply)
        # (4 unchanged attributes hidden)

      - inline_policy {
          - name   = "chatting_api_uat" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:eu-west-2:306744105408:log-group:/aws/lambda/chatting_api_uat*"
                          - Sid      = "EventHandlerPolicy"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy.event_handler must be replaced
-/+ resource "aws_iam_role_policy" "event_handler" {
      ~ id          = "event_handler_execution_role_uat:chatting_api_uat" -> (known after apply)
      ~ name        = "chatting_api_uat" -> "chatting_api_npe" # forces replacement
      + name_prefix = (known after apply)
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:eu-west-2:306744105408:log-group:/aws/lambda/chatting_api_uat*"
                      - Sid      = "EventHandlerPolicy"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ role        = "event_handler_execution_role_uat" # forces replacement -> (known after apply) # forces replacement
    }

  # aws_lambda_function.event_handler must be replaced
-/+ resource "aws_lambda_function" "event_handler" {
      ~ arn                            = "arn:aws:lambda:eu-west-2:306744105408:function:chatting_api_uat" -> (known after apply)
      ~ code_sha256                    = "+T01IikM6bb92RCz+aRWJTxgxtzh4WSRGC9uLMOZyMU=" -> (known after apply)
      ~ function_name                  = "chatting_api_uat" -> "chatting_api_npe" # forces replacement
      ~ id                             = "chatting_api_uat" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:306744105408:function:chatting_api_uat/invocations" -> (known after apply)
      ~ last_modified                  = "2024-05-26T09:23:41.349+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:eu-west-2:306744105408:function:chatting_api_uat:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:306744105408:function:chatting_api_uat:1/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::306744105408:role/service-role/event_handler_execution_role_uat" -> (known after apply)
      ~ s3_key                         = "uat/staging-function.zip" -> "npe/16/merge-function.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 7539 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "1" -> (known after apply)
        # (10 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "POWERTOOLS_SERVICE_NAME" = "chatting_api_uat" -> "chatting_api_npe"
                # (1 unchanged element hidden)
            }
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format = "Text" -> null
          - log_group  = "/aws/lambda/chatting_api_uat" -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_permission.event_handler must be replaced
-/+ resource "aws_lambda_permission" "event_handler" {
      ~ function_name       = "chatting_api_uat" -> "chatting_api_npe" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      ~ source_arn          = "arn:aws:execute-api:eu-west-2:306744105408:uzl46m03j6/uat/POST/event-handler" -> "arn:aws:execute-api:eu-west-2:306744105408:uzl46m03j6/npe/POST/event-handler" # forces replacement
      + statement_id_prefix = (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 7 to add, 2 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: aws_cloudwatch_log_group.event_handler: Refreshing state... [id=/aws/lambda/chatting_api_uat]%0Aaws_iam_role.event_handler_execution_role: Refreshing state... [id=event_handler_execution_role_uat]%0Aaws_cloudwatch_log_group.api_gateway: Refreshing state... [id=/aws/api-gateway/event_handler-uat]%0Aaws_apigatewayv2_api.event_handler: Refreshing state... [id=uzl46m03j6]%0Aaws_lambda_function.event_handler: Refreshing state... [id=chatting_api_uat]%0Aaws_iam_role_policy.event_handler: Refreshing state... [id=event_handler_execution_role_uat:chatting_api_uat]%0Aaws_apigatewayv2_stage.event_handler: Refreshing state... [id=uat]%0Aaws_lambda_permission.event_handler: Refreshing state... [id=AllowExecutionFromAPIGateway]%0Aaws_apigatewayv2_integration.event_handler: Refreshing state... [id=qws0yrt]%0Aaws_apigatewayv2_route.event_handler: Refreshing state... [id=oafi1hp]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # data.aws_iam_policy_document.event_handler will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "event_handler" {%0A      + id            = (known after apply)%0A      + json          = (known after apply)%0A      + minified_json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "logs:CreateLogStream",%0A              + "logs:PutLogEvents",%0A            ]%0A          + resources = [%0A              + (known after apply),%0A            ]%0A          + sid       = "EventHandlerPolicy"%0A        }%0A    }%0A%0A  # aws_apigatewayv2_api.event_handler will be updated in-place%0A  ~ resource "aws_apigatewayv2_api" "event_handler" {%0A        id                           = "uzl46m03j6"%0A      ~ name                         = "event-handler-uat" -> "event-handler-npe"%0A        tags                         = {}%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # aws_apigatewayv2_integration.event_handler will be updated in-place%0A  ~ resource "aws_apigatewayv2_integration" "event_handler" {%0A        id                     = "qws0yrt"%0A      ~ integration_uri        = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:306744105408:function:chatting_api_uat/invocations" -> (known after apply)%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # aws_apigatewayv2_stage.event_handler must be replaced%0A-/+ resource "aws_apigatewayv2_stage" "event_handler" {%0A      ~ arn             = "arn:aws:apigateway:eu-west-2::/apis/uzl46m03j6/stages/uat" -> (known after apply)%0A      ~ deployment_id   = "o7f53q" -> (known after apply)%0A      ~ execution_arn   = "arn:aws:execute-api:eu-west-2:306744105408:uzl46m03j6/uat" -> (known after apply)%0A      ~ id              = "uat" -> (known after apply)%0A      ~ invoke_url      = "https://uzl46m03j6.execute-api.eu-west-2.amazonaws.com/uat" -> (known after apply)%0A      ~ name            = "uat" -> "npe" # forces replacement%0A      - stage_variables = {} -> null%0A      - tags            = {} -> null%0A      ~ tags_all        = {} -> (known after apply)%0A        # (2 unchanged attributes hidden)%0A%0A      ~ access_log_settings {%0A          ~ destination_arn = "arn:aws:logs:eu-west-2:306744105408:log-group:/aws/api-gateway/event_handler-uat" -> (known after apply)%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      - default_route_settings {%0A          - data_trace_enabled       = false -> null%0A          - detailed_metrics_enabled = false -> null%0A          - throttling_burst_limit   = 0 -> null%0A          - throttling_rate_limit    = 0 -> null%0A        }%0A    }%0A%0A  # aws_cloudwatch_log_group.api_gateway must be replaced%0A-/+ resource "aws_cloudwatch_log_group" "api_gateway" {%0A      ~ arn               = "arn:aws:logs:eu-west-2:306744105408:log-group:/aws/api-gateway/event_handler-uat" -> (known after apply)%0A      ~ id                = "/aws/api-gateway/event_handler-uat" -> (known after apply)%0A      ~ log_group_class   = "STANDARD" -> (known after apply)%0A      ~ name              = "/aws/api-gateway/event_handler-uat" -> "/aws/api-gateway/event_handler-npe" # forces replacement%0A      + name_prefix       = (known after apply)%0A      - tags              = {} -> null%0A      ~ tags_all          = {} -> (known after apply)%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # aws_cloudwatch_log_group.event_handler must be replaced%0A-/+ resource "aws_cloudwatch_log_group" "event_handler" {%0A      ~ arn               = "arn:aws:logs:eu-west-2:306744105408:log-group:/aws/lambda/chatting_api_uat" -> (known after apply)%0A      ~ id                = "/aws/lambda/chatting_api_uat" -> (known after apply)%0A      ~ log_group_class   = "STANDARD" -> (known after apply)%0A      ~ name              = "/aws/lambda/chatting_api_uat" -> "/aws/lambda/chatting_api_npe" # forces replacement%0A      + name_prefix       = (known after apply)%0A      - tags              = {} -> null%0A      ~ tags_all          = {} -> (known after apply)%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # aws_iam_role.event_handler_execution_role must be replaced%0A-/+ resource "aws_iam_role" "event_handler_execution_role" {%0A      ~ arn                   = "arn:aws:iam::306744105408:role/service-role/event_handler_execution_role_uat" -> (known after apply)%0A      ~ create_date           = "2024-05-26T09:23:26Z" -> (known after apply)%0A      ~ id                    = "event_handler_execution_role_uat" -> (known after apply)%0A      ~ managed_policy_arns   = [] -> (known after apply)%0A      ~ name                  = "event_handler_execution_role_uat" -> "event_handler_execution_role_npe" # forces replacement%0A      + name_prefix           = (known after apply)%0A      - tags                  = {} -> null%0A      ~ tags_all              = {} -> (known after apply)%0A      ~ unique_id             = "AROAUO227THAGQ5WMUQDP" -> (known after apply)%0A        # (4 unchanged attributes hidden)%0A%0A      - inline_policy {%0A          - name   = "chatting_api_uat" -> null%0A          - policy = jsonencode(%0A                {%0A                  - Statement = [%0A                      - {%0A                          - Action   = [%0A                              - "logs:PutLogEvents",%0A                              - "logs:CreateLogStream",%0A                            ]%0A                          - Effect   = "Allow"%0A                          - Resource = "arn:aws:logs:eu-west-2:306744105408:log-group:/aws/lambda/chatting_api_uat*"%0A                          - Sid      = "EventHandlerPolicy"%0A                        },%0A                    ]%0A                  - Version   = "2012-10-17"%0A                }%0A            ) -> null%0A        }%0A    }%0A%0A  # aws_iam_role_policy.event_handler must be replaced%0A-/+ resource "aws_iam_role_policy" "event_handler" {%0A      ~ id          = "event_handler_execution_role_uat:chatting_api_uat" -> (known after apply)%0A      ~ name        = "chatting_api_uat" -> "chatting_api_npe" # forces replacement%0A      + name_prefix = (known after apply)%0A      ~ policy      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action   = [%0A                          - "logs:PutLogEvents",%0A                          - "logs:CreateLogStream",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = "arn:aws:logs:eu-west-2:306744105408:log-group:/aws/lambda/chatting_api_uat*"%0A                      - Sid      = "EventHandlerPolicy"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> (known after apply)%0A      ~ role        = "event_handler_execution_role_uat" # forces replacement -> (known after apply) # forces replacement%0A    }%0A%0A  # aws_lambda_function.event_handler must be replaced%0A-/+ resource "aws_lambda_function" "event_handler" {%0A      ~ arn                            = "arn:aws:lambda:eu-west-2:306744105408:function:chatting_api_uat" -> (known after apply)%0A      ~ code_sha256                    = "+T01IikM6bb92RCz+aRWJTxgxtzh4WSRGC9uLMOZyMU=" -> (known after apply)%0A      ~ function_name                  = "chatting_api_uat" -> "chatting_api_npe" # forces replacement%0A      ~ id                             = "chatting_api_uat" -> (known after apply)%0A      ~ invoke_arn                     = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:306744105408:function:chatting_api_uat/invocations" -> (known after apply)%0A      ~ last_modified                  = "2024-05-26T09:23:41.349+0000" -> (known after apply)%0A      - layers                         = [] -> null%0A      ~ qualified_arn                  = "arn:aws:lambda:eu-west-2:306744105408:function:chatting_api_uat:1" -> (known after apply)%0A      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:306744105408:function:chatting_api_uat:1/invocations" -> (known after apply)%0A      ~ role                           = "arn:aws:iam::306744105408:role/service-role/event_handler_execution_role_uat" -> (known after apply)%0A      ~ s3_key                         = "uat/staging-function.zip" -> "npe/16/merge-function.zip"%0A      + signing_job_arn                = (known after apply)%0A      + signing_profile_version_arn    = (known after apply)%0A      + source_code_hash               = (known after apply)%0A      ~ source_code_size               = 7539 -> (known after apply)%0A      - tags                           = {} -> null%0A      ~ tags_all                       = {} -> (known after apply)%0A      ~ version                        = "1" -> (known after apply)%0A        # (10 unchanged attributes hidden)%0A%0A      ~ environment {%0A          ~ variables = {%0A              ~ "POWERTOOLS_SERVICE_NAME" = "chatting_api_uat" -> "chatting_api_npe"%0A                # (1 unchanged element hidden)%0A            }%0A        }%0A%0A      - ephemeral_storage {%0A          - size = 512 -> null%0A        }%0A%0A      - logging_config {%0A          - log_format = "Text" -> null%0A          - log_group  = "/aws/lambda/chatting_api_uat" -> null%0A        }%0A%0A      - tracing_config {%0A          - mode = "PassThrough" -> null%0A        }%0A    }%0A%0A  # aws_lambda_permission.event_handler must be replaced%0A-/+ resource "aws_lambda_permission" "event_handler" {%0A      ~ function_name       = "chatting_api_uat" -> "chatting_api_npe" # forces replacement%0A      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)%0A      ~ source_arn          = "arn:aws:execute-api:eu-west-2:306744105408:uzl46m03j6/uat/POST/event-handler" -> "arn:aws:execute-api:eu-west-2:306744105408:uzl46m03j6/npe/POST/event-handler" # forces replacement%0A      + statement_id_prefix = (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0APlan: 7 to add, 2 to change, 7 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 2024-05-26T09:33:51.950Z [INFO]  Terraform version: 1.5.3%0A2024-05-26T09:33:51.950Z [INFO]  Go runtime version: go1.20%0A2024-05-26T09:33:51.950Z [INFO]  CLI args: []string{"/home/runner/work/_temp/a959d4d1-c6f2-435a-99ba-8d1e2bc0f51f/terraform-bin", "plan", "-no-color", "-var", "git_branch=16/merge", "-var", "environment=npe", "-var", "filepath=base-eng-fxn-bucket"}%0A2024-05-26T09:33:51.950Z [INFO]  CLI command args: []string{"plan", "-no-color", "-var", "git_branch=16/merge", "-var", "environment=npe", "-var", "filepath=base-eng-fxn-bucket"}%0A2024-05-26T09:33:51.954Z [INFO]  AWS Auth provider used: "EnvProvider"%0A2024-05-26T09:33:53.170Z [INFO]  backend/local: starting Plan operation%0A2024-05-26T09:33:53.865Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-26T09:33:53.970Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: configuring server automatic mTLS: timestamp=2024-05-26T09:33:53.970Z%0A2024-05-26T09:33:54.648Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-26T09:33:54.730Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: configuring server automatic mTLS: timestamp=2024-05-26T09:33:54.730Z%0A2024-05-26T09:33:55.355Z [INFO]  backend/local: plan calling Plan%0A2024-05-26T09:33:55.358Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-26T09:33:55.441Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: configuring server automatic mTLS: timestamp=2024-05-26T09:33:55.440Z%0A2024-05-26T09:33:56.028Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: Retrieved credentials: tf_rpc=ConfigureProvider tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws @module=aws.aws-base tf_aws.credentials_source=EnvConfigCredentials tf_req_id=b8c4cf02-70f3-67e2-88c4-24eae9cd997e @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 timestamp=2024-05-26T09:33:56.028Z%0A2024-05-26T09:33:56.406Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: Retrieved caller identity from STS: tf_mux_provider=*schema.GRPCProviderServer tf_req_id=b8c4cf02-70f3-67e2-88c4-24eae9cd997e @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 timestamp=2024-05-26T09:33:56.406Z%0A2024-05-26T09:33:56.408Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-26T09:33:56.408Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-26T09:33:56.408Z [INFO]  ReferenceTransformer: reference not found: "var.function_name"%0A2024-05-26T09:33:56.408Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-26T09:33:56.408Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-26T09:33:56.634Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_role.event_handler_execution_role during refresh.%0A      - .tags: was null, but now cty.MapValEmpty(cty.String)%0A      - .inline_policy: actual set element cty.ObjectVal(map[string]cty.Value{"name":cty.StringVal("chatting_api_uat"), "policy":cty.StringVal("{\"Version\":\"2012-10-17\",\"Statement\":[{\"Action\":[\"logs:PutLogEvents\",\"logs:CreateLogStream\"],\"Effect\":\"Allow\",\"Resource\":\"arn:aws:logs:eu-west-2:306744105408:log-group:/aws/lambda/chatting_api_uat*\",\"Sid\":\"EventHandlerPolicy\"}]}")}) does not correlate with any element in plan%0A      - .inline_policy: block set length changed from 0 to 1%0A2024-05-26T09:33:56.637Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_role.event_handler_execution_role, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .force_detach_policies: planned value cty.False for a non-computed attribute%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A      - .description: planned value cty.StringVal("") for a non-computed attribute%0A      - .permissions_boundary: planned value cty.StringVal("") for a non-computed attribute%0A2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.publish"%0A2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.architectures"%0A2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.git_branch"%0A2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.filepath"%0A2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.runtime"%0A2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.function_name"%0A2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.timeout"%0A2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.package_type"%0A2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.function_handler"%0A2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.function_name"%0A2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-26T09:33:56.640Z [INFO]  ReferenceTransformer: reference not found: "var.log_level"%0A2024-05-26T09:33:56.770Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_apigatewayv2_api.event_handler during refresh.%0A      - .tags: was null, but now cty.MapValEmpty(cty.String)%0A2024-05-26T09:33:56.773Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_apigatewayv2_api.event_handler, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .description: planned value cty.StringVal("") for a non-computed attribute%0A      - .route_selection_expression: planned value cty.StringVal("$request.method $request.path") for a non-computed attribute%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A      - .version: planned value cty.StringVal("") for a non-computed attribute%0A      - .api_key_selection_expression: planned value cty.StringVal("$request.header.x-api-key") for a non-computed attribute%0A      - .disable_execute_api_endpoint: planned value cty.False for a non-computed attribute%0A2024-05-26T09:33:56.894Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_cloudwatch_log_group.event_handler during refresh.%0A      - .tags: was null, but now cty.MapValEmpty(cty.String)%0A2024-05-26T09:33:56.897Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_log_group.event_handler, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .kms_key_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .skip_destroy: planned value cty.False for a non-computed attribute%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A2024-05-26T09:33:56.899Z [INFO]  ReferenceTransformer: reference not found: "var.function_name"%0A2024-05-26T09:33:56.899Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-26T09:33:56.900Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_cloudwatch_log_group.api_gateway during refresh.%0A      - .tags: was null, but now cty.MapValEmpty(cty.String)%0A2024-05-26T09:33:56.903Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_log_group.api_gateway, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .skip_destroy: planned value cty.False for a non-computed attribute%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A      - .kms_key_id: planned value cty.StringVal("") for a non-computed attribute%0A2024-05-26T09:33:56.904Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-26T09:33:57.214Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_lambda_function.event_handler during refresh.%0A      - .tags: was null, but now cty.MapValEmpty(cty.String)%0A      - .last_modified: was cty.StringVal("2024-05-26T09:23:35.359+0000"), but now cty.StringVal("2024-05-26T09:23:41.349+0000")%0A      - .layers: was null, but now cty.ListValEmpty(cty.String)%0A2024-05-26T09:33:57.221Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lambda_function.event_handler, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .kms_key_arn: planned value cty.StringVal("") for a non-computed attribute%0A      - .layers: planned value cty.ListValEmpty(cty.String) for a non-computed attribute%0A      - .code_signing_config_arn: planned value cty.StringVal("") for a non-computed attribute%0A      - .skip_destroy: planned value cty.False for a non-computed attribute%0A      - .reserved_concurrent_executions: planned value cty.NumberIntVal(-1) for a non-computed attribute%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A      - .image_uri: planned value cty.StringVal("") for a non-computed attribute%0A      - .memory_size: planned value cty.NumberIntVal(128) for a non-computed attribute%0A      - .description: planned value cty.StringVal("") for a non-computed attribute%0A      - .logging_config: block count in plan (1) disagrees with count in config (0)%0A      - .ephemeral_storage: block count in plan (1) disagrees with count in config (0)%0A      - .tracing_config: block count in plan (1) disagrees with count in config (0)%0A2024-05-26T09:33:57.228Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-26T09:33:57.263Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_apigatewayv2_stage.event_handler during refresh.%0A      - .deployment_id: was cty.StringVal(""), but now cty.StringVal("o7f53q")%0A      - .stage_variables: was null, but now cty.MapValEmpty(cty.String)%0A      - .tags: was null, but now cty.MapValEmpty(cty.String)%0A2024-05-26T09:33:57.266Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_apigatewayv2_stage.event_handler, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .description: planned value cty.StringVal("") for a non-computed attribute%0A      - .stage_variables: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A      - .client_certificate_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A      - .default_route_settings: block count in plan (1) disagrees with count in config (0)%0A2024-05-26T09:33:57.332Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lambda_permission.event_handler, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .qualifier: planned value cty.StringVal("") for a non-computed attribute%0A2024-05-26T09:33:57.386Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_apigatewayv2_integration.event_handler during refresh.%0A      - .request_parameters: was null, but now cty.MapValEmpty(cty.String)%0A      - .request_templates: was null, but now cty.MapValEmpty(cty.String)%0A2024-05-26T09:33:57.389Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_apigatewayv2_integration.event_handler, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .template_selection_expression: planned value cty.StringVal("") for a non-computed attribute%0A      - .content_handling_strategy: planned value cty.StringVal("") for a non-computed attribute%0A      - .integration_subtype: planned value cty.StringVal("") for a non-computed attribute%0A      - .request_parameters: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A      - .passthrough_behavior: planned value cty.StringVal("") for a non-computed attribute%0A      - .payload_format_version: planned value cty.StringVal("1.0") for a non-computed attribute%0A      - .connection_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .credentials_arn: planned value cty.StringVal("") for a non-computed attribute%0A      - .description: planned value cty.StringVal("") for a non-computed attribute%0A      - .request_templates: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A2024-05-26T09:33:57.542Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_apigatewayv2_route.event_handler during refresh.%0A      - .request_models: was null, but now cty.MapValEmpty(cty.String)%0A      - .authorization_scopes: was null, but now cty.SetValEmpty(cty.String)%0A2024-05-26T09:33:57.544Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_apigatewayv2_route.event_handler, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .api_key_required: planned value cty.False for a non-computed attribute%0A      - .authorization_scopes: planned value cty.SetValEmpty(cty.String) for a non-computed attribute%0A      - .authorizer_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .request_models: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A      - .operation_name: planned value cty.StringVal("") for a non-computed attribute%0A      - .route_response_selection_expression: planned value cty.StringVal("") for a non-computed attribute%0A      - .authorization_type: planned value cty.StringVal("NONE") for a non-computed attribute%0A      - .model_selection_expression: planned value cty.StringVal("") for a non-computed attribute%0A2024-05-26T09:33:57.558Z [INFO]  backend/local: plan operation completed%0A
::debug::exitcode: 0

```